"""
Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
"""

n = int(input('Введите номер буквы: '))
print(f'Буква: {chr(n + 96)}')
